In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

# Database use of this section 
titanic = sns.load_dataset('titanic')

In [2]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
titanic['survived'].sum()

342

In [4]:
len(titanic)

891

In [5]:
titanic['survived'].sum() / len(titanic)

0.3838383838383838

In [19]:
male_survivor = titanic.query('survived == 1 & sex == "male"')
male_survivor['survived'].count()

109

In [20]:
male_survivor = titanic.query('sex == "male"')
male_survivor['survived'].count()

577

In [23]:
titanic.query('survived == 1 & sex == "male"').count() / titanic.query('sex == "male"').count()

survived       0.188908
pclass         0.188908
sex            0.188908
age            0.205298
sibsp          0.188908
parch          0.188908
fare           0.188908
embarked       0.188908
class          0.188908
who            0.188908
adult_male     0.188908
deck           0.424528
embark_town    0.188908
alive          0.188908
alone          0.188908
dtype: float64

In [26]:
titanic.query('survived == 1 & sex == "male"').count() / titanic.count()

survived       0.122334
pclass         0.122334
sex            0.122334
age            0.130252
sibsp          0.122334
parch          0.122334
fare           0.122334
embarked       0.122610
class          0.122334
who            0.122334
adult_male     0.122334
deck           0.221675
embark_town    0.122610
alive          0.122334
alone          0.122334
dtype: float64

In [24]:
#  pivot tables can be specified with multiple levels
# using pd.cut to get age intervals
age = pd.cut(titanic['age'], [0, 18, 80])
titanic.pivot_table('survived', ['sex', age], 'class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663

In [25]:
# using pd.qcut to automatically compute quantiles
fare = pd.qcut(titanic['fare'], 2)
# Sex and age use as multi Index
# Fare pair and class use as columns
titanic.pivot_table('survived', ['sex', age], [fare, 'class'])

fare            (-0.001, 14.454]                     (14.454, 512.329]  \
class                      First    Second     Third             First
sex    age
female (0, 18]               NaN  1.000000  0.714286          0.909091
       (18, 80]              NaN  0.880000  0.444444          0.972973
male   (0, 18]               NaN  0.000000  0.260870          0.800000
       (18, 80]              0.0  0.098039  0.125000          0.391304

fare
class              Second     Third
sex    age
female (0, 18]   1.000000  0.318182
       (18, 80]  0.914286  0.391304
male   (0, 18]   0.818182  0.178571
       (18, 80]  0.030303  0.192308